In [116]:
# We can use the pandas library in python to read in the csv file.
import pandas as pd
#for numerical computaions we can use numpy library
import numpy as np

In [117]:
# This creates a pandas dataframe and assigns it to the titanic variable.
titanic = pd.read_csv("titanic/train.csv")
# Print the first 5 rows of the dataframe.
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [118]:
titanic_test = pd.read_csv("titanic/test.csv")
titanic_test.columns

Index([u'PassengerId', u'Pclass', u'Name', u'Sex', u'Age', u'SibSp', u'Parch',
       u'Ticket', u'Fare', u'Cabin', u'Embarked'],
      dtype='object')

In [119]:
print(titanic.shape)
print(titanic_test.shape)

(891, 12)
(418, 11)

In [120]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [121]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [122]:
titanic_test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [123]:
titanic.Embarked = titanic.Embarked.fillna("C")

In [124]:
median_fare = titanic_test[(titanic_test.Pclass == 3) & (titanic_test.Embarked == 'S')].Fare.median()
print(median_fare)
titanic_test.Fare = titanic_test.Fare.fillna(8.05)

8.05

In [125]:
titanic_test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

In [126]:
titanic.Deck = titanic.Cabin.str[0]
titanic_test.Deck = titanic_test.Cabin.str[0]

In [127]:
print(titanic.Deck.unique())
print(titanic_test.Deck.unique())

[nan 'C' 'E' 'G' 'D' 'A' 'B' 'F' 'T']
[nan 'B' 'E' 'A' 'C' 'D' 'F' 'G']

In [128]:
titanic.Deck = titanic.Deck.fillna("Z")
titanic_test.Deck = titanic_test.Deck.fillna("Z")

In [129]:
titanic.Deck = titanic.Deck.replace(["A","B","C","D","E","F","G","T","Z"],[1,2,3,4,5,6,7,8,9])
titanic["Deck"] = titanic.Deck

In [130]:
titanic.Embarked = titanic.Embarked.replace(["C","Q","S"],[1,2,3])
titanic["Embarked"] = titanic.Embarked
from sklearn.ensemble import RandomForestRegressor
def fill_missing_age(df):
    age_df = df[['Age','Embarked','Fare', 'Parch', 'SibSp','Pclass','Deck']]
    train  = age_df.loc[ (df.Age.notnull()) ]
    test = age_df.loc[ (df.Age.isnull()) ]
    y = train.values[:, 0]
    x = train.values[:, 1::]
    rtr = RandomForestRegressor(n_estimators=2000, n_jobs=-1)
    rtr.fit(x, y)
    predictedAges = rtr.predict(test.values[:, 1::])
    df.loc[ (df.Age.isnull()),'Age'] = predictedAges
    return df
titanic = fill_missing_age(titanic)

In [134]:
titanic_test.Deck = titanic_test.Deck.replace(["A","B","C","D","E","F","G","T","Z"],[1,2,3,4,5,6,7,8,9])
titanic_test["Deck"] = titanic_test.Deck
titanic_test.Embarked = titanic_test.Embarked.replace(["C","Q","S"],[1,2,3])
titanic_test["Embarked"] = titanic_test.Embarked
titanic_test = fill_missing_age(titanic_test)
titanic_test["Age"].isnull().sum()

0